{
  "common": {
    "theme-mode": "Turn on {theme} mode",
    "theme": {
      "light": "Light",
      "dark": "Dark"
    }
  },
  "layout": {
    "language": "Language",
    "select-language": "Select Language",
    "sections-list": {
      "home": "Home",
      "about": "About Me",
      "experience": "Experience",
      "skills": "Skills",
      "projects": "Projects",
      "contact": "Contact"
    },
    "sections_content": {
      "home": {
        "greeting": "Hi, I'm {name}!",
        "role": "Developer",
        "subrole": "Web",
        "subrole1": "Backend",
        "subrole2": "Frontend",
        "role2": "Backend Developer",
        "role3": "Frontend Developer",
        "description": "Self-taught Full-Stack software developer from Venezuela, passionate about solving problems through software, mainly focused on Backend development."
      },
      "about": {
        "title": "About",
        "description": {
          "p1": "Web developer passionate about creating functional, fast, and user-centered digital solutions. I am currently part of the OCAM Group team, where I participate in the development and maintenance of web applications that optimize processes and generate real value for the business.",
          "p2": "With a background from the University Institute of Industrial Administration Technology, I combine solid technical knowledge with a practical approach to deliver high-quality projects in dynamic environments. I specialize in front-end and back-end development, working with modern technologies to build intuitive interfaces and robust systems.",
          "p3": "I am motivated by solving real-world problems through code, continuous learning, and collaborating in multidisciplinary teams. I am always looking for opportunities to contribute to innovative projects, whether by improving the user experience, optimizing performance, or implementing new functionalities."
        }
      },
      "skills": {
        "title": "Arsenal Tech",
        "description": "I specialize in a variety of languages, frameworks, and tools that allow me to build robust and scalable applications.",
        "description2": "As a Full-Stack developer, I have cultivated a balanced mastery of frontend, backend, and databases, enabling me to handle complete projects from conception to implementation. My stack reflects both production experience and active exploration of modern technologies."
      },
      "contact": {
        "title": "Contact",
        "description": "I'm currently open to new opportunities and collaborations. Whether you have a product idea, want to discuss a role, or simply want to connect, I'd be happy to hear from you. You can reach me this form or <link>LinkedIn</link> — let's talk about what you're building.",
        "form": {
          "full-name": "Full Name",
          "email": "Email",
          "message": "Message",
          "characters": "characters",
          "reset": "Reset",
          "send": "Send",
          "sending": "Sending...",
          "actions": {
            "sending": "Sending email...",
            "sent": "Contact email sent!",
            "unexpected-error": "An unexpected error occurred while sending the email."
          }
        }
      },
      "experience": {
        "title": "Experience",
        "experiences": {
          "0": {
            "year": "Mar 2022 - Present",
            "title": "Full-Stack Web Programmer Analyst",
            "company": "OCAM Group",
            "Description": "Design and development of customized business solutions for diverse clients, collaborating in the creation of comprehensive systems that optimize organizational processes.",
            "technologies": {
              "0": {
                "type": "database",
                "items": "MicrosoftSQLServer"
              },
              "1": {
                "type": "backend",
                "items": "Laravel"
              },
              "2": {
                "type": "frontend",
                "items": ["JQuery", "Lit", "Bootstrap"]
              }
            }
          },
          "1": {
            "year": "Aug 2021 - Jan 2022",
            "title": "Full-Stack Web Developer",
            "company": "Hi Connection",
            "Description": "I worked on the development of different projects, as well as the development of a streaming platform and an internal management system, taking full responsibility for the user interface and business logic.",
            "technologies": {
              "0": {
                "type": "database",
                "items": ["MySQL", "MongoDB"]
              },
              "1": {
                "type": "backend",
                "items": ["NestJS", "Express"]
              },
              "2": {
                "type": "frontend",
                "items": ["NextJS", "React", "MaterialUI"]
              }
            }
          },
          "2": {
            "year": "Feb 2021 - Feb 2022",
            "title": "Web Developer",
            "company": "Mayor's Office of the Tourist Municipality of El Morro \"Lcdo. Diego Bautista Urbaneja\"",
            "Description": "I contributed to the digital modernization of processes by developing internal systems that improved operational efficiency, creating the following systems:<list><listitem>Time and attendance management system.</listitem><listitem>Permit management system for occupying spaces within the municipality, selling alcoholic beverages, and displaying advertising.</listitem></list>",
            "technologies": {
              "0": {
                "type": "database",
                "items": ["MySQL", "MongoDB"]
              },
              "1": {
                "type": "backend",
                "items": ["PHP", "Express"]
              },
              "2": {
                "type": "frontend",
                "items": ["JQuery", "Bootstrap", "React", "MaterialUI"]
              }
            }
          }
        }
      }
    },
    "footer": "<paragraph>Designed and Developed by Nolasco Malavé.</paragraph><paragraph>Built with <highlighted>Next.js</highlighted>, <highlighted>Shadcn</highlighted> & <highlighted>Tailwind</highlighted>. Hosted on Vercel.</paragraph>"
  }
}