{
  "common": {
    "theme-mode": "Turn on {theme} mode",
    "theme": {
      "light": "Light",
      "dark": "Dark"
    }
  },
  "layout": {
    "language": "Language",
    "select-language": "Select Language",
    "sections-list": {
      "home": "Home",
      "about": "About Me",
      "skills": "Skills",
      "projects": "Projects",
      "contact": "Contact"
    },
    "sections_content": {
      "home": {
        "greeting": "Hi, I'm {name}!",
        "role": "Developer",
        "subrole": "Web",
        "subrole1": "Backend",
        "subrole2": "Frontend",
        "role2": "Backend Developer",
        "role3": "Frontend Developer",
        "description": "Self-taught Full-Stack software developer from Venezuela, passionate about solving problems through software, mainly focused on Backend development."
      },
      "about": {
        "title": "About",
        "description": {
          "p1": "Web developer passionate about creating functional, fast, and user-centered digital solutions. I am currently part of the OCAM Group team, where I participate in the development and maintenance of web applications that optimize processes and generate real value for the business.",
          "p2": "With a background from the University Institute of Industrial Administration Technology, I combine solid technical knowledge with a practical approach to deliver high-quality projects in dynamic environments. I specialize in front-end and back-end development, working with modern technologies to build intuitive interfaces and robust systems.",
          "p3": "I am motivated by solving real-world problems through code, continuous learning, and collaborating in multidisciplinary teams. I am always looking for opportunities to contribute to innovative projects, whether by improving the user experience, optimizing performance, or implementing new functionalities."
        }
      },
      "skills": {
        "title": "Arsenal Tech",
        "description": "I specialize in a variety of languages, frameworks, and tools that allow me to build robust and scalable applications.",
        "description2": "As a Full Stack developer, I have cultivated a balanced mastery of frontend, backend, and databases, enabling me to handle complete projects from conception to implementation. My stack reflects both production experience and active exploration of modern technologies."
      },
      "contact": {
        "title": "Contact",
        "description": "I'm currently open to new opportunities and collaborations. Whether you have a product idea, want to discuss a role, or simply want to connect, I'd be happy to hear from you. You can reach me this form or <link>LinkedIn</link> — let's talk about what you're building."
      }
    },
    "footer": "<paragraph>Designed and Developed by Nolasco Malavé.</paragraph><paragraph>Built with <highlighted>Next.js</highlighted>, <highlighted>Shadcn</highlighted> & <highlighted>Tailwind</highlighted>. Hosted on Vercel.</paragraph>"
  }
}