{
  "common": {
    "theme-mode": "Activar modo {theme}",
    "theme": {
      "light": "Claro",
      "dark": "Oscuro"
    }
  },
  "layout": {
    "language": "Idioma",
    "select-language": "Seleccionar idioma",
    "sections-list": {
      "home": "Inicio",
      "about": "Sobre Mí",
      "experience": "Experiencia",
      "skills": "Habilidades",
      "projects": "Proyectos",
      "contact": "Contacto"
    },
    "sections_content": {
      "home": {
        "greeting": "¡Hola, Soy {name}!",
        "role": "Desarrollador",
        "subrole": "Web",
        "subrole1": "Backend",
        "subrole2": "Frontend",
        "description": "Desarrollador de software Full-Stack autodidacta de Venezuela, apasionado por la resolución de problemas a través de software, mayormente orientado al desarrollo Backend."
      },
      "about": {
        "title": "Sobre Mí",
        "description": {
          "p1": "Desarrollador Web apasionado por crear soluciones digitales funcionales, rápidas y centradas en el usuario. Actualmente formo parte del equipo de OCAM Group, donde participo en el desarrollo y mantenimiento de aplicaciones web que optimizan procesos y generan valor real para el negocio.",
          "p2": "Con formación en el Instituto Universitario de Tecnología de Administración Industrial, combino conocimientos técnicos sólidos con un enfoque práctico para entregar proyectos de calidad en entornos dinámicos. Me especializo en el desarrollo web, trabajando con tecnologías modernas para construir interfaces intuitivas y sistemas robustos.",
          "p3": "Me motiva resolver problemas reales a través del código, aprender continuamente y colaborar en equipos multidisciplinarios. Siempre busco oportunidades para contribuir en proyectos innovadores, ya sea mejorando la experiencia del usuario, optimizando rendimiento o implementando nuevas funcionalidades."
        }
      },
      "skills": {
        "title": "Arsenal Tecnológico",
        "description": "Me especializo en una variedad de lenguajes, marcos y herramientas que me permiten crear aplicaciones robustas y escalables.",
        "description2": "Como desarrollador Full-Stack, he cultivado un dominio equilibrado entre frontend, backend y bases de datos, permitiéndome abordar proyectos completos desde la concepción hasta la implementación. Mi stack refleja tanto experiencia en producción como exploración activa de tecnologías modernas."
      },
      "contact": {
        "title": "Contacto",
        "description": "Estoy abierto a nuevas oportunidades y colaboraciones. Si tienes una idea de producto, quieres hablar sobre un puesto o simplemente quieres conectar, me encantaría saber de ti. Puedes contactarme a través de este formulario o <link>LinkedIn</link> - hablemos de lo que estás desarrollando."
      },
      "experience": {
        "title": "Experiencia",
        "experiences": {
          "0": {
            "year": "Mar 2022 - Actualidad",
            "title": "Analista Programador Web Full-Stack",
            "company": "OCAM Group",
            "Description": "Diseño y desarrollo de soluciones empresariales personalizadas para diversos clientes, colaborando en la creación de sistemas integrales que optimizan procesos organizacionales.",
            "technologies": {
              "0": {
                "type": "database",
                "items": "MicrosoftSQLServer"
              },
              "1": {
                "type": "backend",
                "items": "Laravel"
              },
              "2": {
                "type": "frontend",
                "items": ["JQuery", "Lit", "Bootstrap"]
              }
            }
          },
          "1": {
            "year": "Ago 2021 - Ene 2022",
            "title": "Desarrollador Web Full-Stack",
            "company": "Hi Connection",
            "Description": "Trabajé en el desarrollo de diferentes proyectos, así como en el desarrollo de una plataforma de streaming y un sistema de gestión interna, encargándome completamente de la interfaz de usuario y la lógica de negocio.",
            "technologies": {
              "0": {
                "type": "database",
                "items": ["MySQL", "MongoDB"]
              },
              "1": {
                "type": "backend",
                "items": ["NestJS", "Express"]
              },
              "2": {
                "type": "frontend",
                "items": ["NextJS", "React", "MaterialUI"]
              }
            }
          },
          "2": {
            "year": "Feb 2021 - Feb 2022",
            "title": "Desarrollador Web",
            "company": "Alcaldía del Municipio Turístico El Morro \"Lcdo. Diego Bautista Urbaneja\"",
            "Description": "Contribuí a la modernización digital de procesos mediante el desarrollo de sistemas internos que mejoraron la eficiencia operativa, creando los siguientes sistemas:<list><listitem>Sistema de gestión de horario y asistencia.</listitem><listitem>Sistema de gestión de permisos para ocupar de espacios dentro del municipio, vender bebidas alcohólicas y desplegar publicidad.</listitem></list>",
            "technologies": {
              "0": {
                "type": "database",
                "items": ["MySQL", "MongoDB"]
              },
              "1": {
                "type": "backend",
                "items": ["PHP", "Express"]
              },
              "2": {
                "type": "frontend",
                "items": ["JQuery", "Bootstrap", "React", "MaterialUI"]
              }
            }
          }
        }
      }
    },
    "footer": "<paragraph>Diseñado y Desarrollado por Nolasco Malavé.</paragraph><paragraph>Construido con <highlighted>Next.js</highlighted>, <highlighted>Shadcn</highlighted> y <highlighted>Tailwind</highlighted>. Alojado en Vercel.</paragraph>"
  }
}